In [101]:
import pandas as pd

In [102]:
import numpy as np

In [103]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d ={'a':10, 'b': 20, 'c':30 }

In [104]:
pd.Series(data=my_data) #we get indexes, 0,1,2. we can specify index

0    10
1    20
2    30
dtype: int64

In [105]:
pd.Series(data=my_data, index=labels) #we can also put(my_data,labels) in a correct order!

a    10
b    20
c    30
dtype: int64

In [106]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [107]:
pd.Series(d) # it takes automatically the keys from a dictionary and puts it as labels

a    10
b    20
c    30
dtype: int64

In [108]:
pd.Series(data=labels) # it can hold any types of objects

0    a
1    b
2    c
dtype: object

In [109]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [110]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [111]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan']) # we pass data and indexes as list, (into squere brackets []!!!)

In [112]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [113]:
ser1['USA'] # we can find a data point assigned to an index

1

In [114]:
ser3 = pd.Series(data=labels)

In [115]:
ser3

0    a
1    b
2    c
dtype: object

In [116]:
ser3[1]

'b'

In [117]:
ser1 + ser2 # it adds data points assigned to a same index in both series. when it cannot find a match, then it puts NaN

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [118]:
from numpy.random import randn

In [119]:
np.random.seed(101) #same random points as in the course

In [120]:
df =pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [121]:
df # we get list of columns with corresponding rows. each column is a pandas series. they all share the same index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [122]:
df['W'] # returns W column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [123]:
type(df['W']) # confirms that a column is a pandas series

pandas.core.series.Series

In [124]:
df.W # other way to find a columns, similar to SQL, but not recommended. BETTER USE BRACKET NOTATION

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [125]:
df[['W','Z']] # if we want more columns, we have to pass a list of columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [126]:
df['new'] = df['W'] + df['Y'] # creating column from existing ones

In [127]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [128]:
df.drop('new') #axis=0 ROW COLUMNS, so when we want to drop a clomun, we have to specify axis as 1

KeyError: "['new'] not found in axis"

In [129]:
df.drop('new',axis=1) # if we want to drop a column forever, we have to put inplace= True arguent

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [130]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [131]:
df.drop('new',axis=1,inplace=True)

In [132]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [133]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [134]:
df.shape #first number in tuple represend rows, thats why 0 refers to rows and 1 to columns

(5, 4)

In [135]:
df.loc['C'] # how to find rows, rows are also series

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [136]:
#other way to find a row, finding rows by index location
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [137]:
df.loc['B','Y'] #row we want, column we want

-0.8480769834036315

In [138]:
df.loc[['A','B'],['W','Y']] #rows we want, and columns we want

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [139]:
booldf = df > 0 # we get back a data frame of boolean values

In [140]:
df[booldf] # conditional seleciton on data drame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [141]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [142]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [143]:
df[df['W']>0] # it gives back data frame without the row where the value was less than 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [144]:
# where z is less than 0
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [145]:
resultdf = df[df['W']>0]

In [146]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [147]:
df[df['W']>0]['X'] # same as above, bracket notation !

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [148]:
# same as above but broke into more steps 
boolser = df['W']>0 
result = df[boolser]
result[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [149]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [150]:
df[(df['W']>0)&(df['Y']>1)] # more operations, we cannot use standard and python operator. important to use brackets() !!!!!

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [151]:
df[(df['W']>0) | (df['Y']>1)] # or operator, option 7 on a keyboard

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [152]:
df.reset_index() # reserting index, NOT INPLACE!, so original data frame is same

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [153]:
newind = ' CA NY WY OR CO'.split() # easy way to split a string on white space

In [154]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [155]:
df['States'] = newind

In [156]:
df.set_index('States') # we set a column as a index. IT IS INPLACE!!!, so we cannot see infor we had before

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [157]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [158]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [159]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [160]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [161]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [162]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [163]:
# how to call data from multi index
df.loc['G1'].loc[1] # we call from the outside index to the inside one

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [164]:
df.index.names = ['Grupes','Num']

In [165]:
df

                   A         B
Grupes Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [166]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [167]:
#df.xs - cross section, we use when we have multi level index

In [168]:
df.xs(1,level='Num') # grabs a cross section of level num equal to 1

               A         B
Grupes
G1      0.302665  1.693723
G2      0.166905  0.184502

In [169]:
# MISSING DATA

In [170]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [171]:
df = pd.DataFrame(d)

In [172]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [173]:
df.dropna() # drops any row with nan (one or more)
# axis 1 - on column

     A    B  C
0  1.0  5.0  1

In [174]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [175]:
df.dropna(thresh=2) # drops 2 nan rows or more

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [176]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [177]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [178]:
# GROUP BY allows to group together rows based off of a column and perform an aggregate function on them

In [179]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [180]:
df = pd.DataFrame(data)

In [181]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [182]:
# grouping by company column
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [185]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [186]:
df.groupby('Company').count() # number of instances

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [188]:
df.groupby('Company').describe().transpose() #transpose - companies are column

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [189]:
# merging, joining, concatenating

In [193]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [194]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [195]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [196]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [197]:
pd.concat([df1,df2,df3], axis = 1) # we have to check if we have everything correct before concatenating them

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [198]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})
#key column is same in both data frames

In [199]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [200]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [201]:
pd.merge(left,right,how='inner',on='key') # we merging on a column shared for both data frames
# how - same as in SQL

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [202]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [203]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [204]:
# operations

In [205]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [206]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [208]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [209]:
df['col2'].unique()

array([444, 555, 666])

In [210]:
len(df['col2'].unique()) # or nunique - how many unique values in a column

3

In [212]:
df['col2'].value_counts() # how many times a value occured in a column

444    2
555    1
666    1
Name: col2, dtype: int64

In [215]:
def times2(x):
    return x*2

In [216]:
df['col1'].apply(times2) # apply custom funtion or built in functions f.e len

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [217]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [220]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [221]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [223]:
df.sort_values(by ='col2') #sort by column 2, index stays attached

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [224]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [227]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [228]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [229]:
df.pivot_table(values='D',index=['A','B'],columns=['C']) #multi index

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [233]:
pd.read_csv('example.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'example.csv'